In [4]:
from mysql.connector import connect
import pandas as pd

In [6]:
conn = connect(host='localhost', port=3308, database='hr', user='root', password='')

In [7]:
sql = '''SELECT employee_id, first_name, hire_date, YEAR(NOW()) - YEAR(hire_date) AS tham_nien
    FROM employees
    ORDER BY tham_nien DESC;'''
df = pd.read_sql(sql, conn)
conn.close()

In [8]:
df.head()

   employee_id first_name   hire_date  tham_nien
0          102        Lex  2001-01-13         19
1          108      Nancy  2002-08-17         18
2          109     Daniel  2002-08-16         18
3          114        Den  2002-12-07         18
4          203      Susan  2002-06-07         18

In [9]:
df.tail()

     employee_id first_name   hire_date  tham_nien
102          167       Amit  2008-04-21         12
103          173    Sundita  2008-04-21         12
104          179    Charles  2008-01-04         12
105          183     Girard  2008-02-03         12
106          199    Douglas  2008-01-13         12